###############################################################################
# Created by write_sdc
# Thu Nov 30 12:53:26 2023
###############################################################################
current_design SoC
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 48.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {OUT_DCT_ce}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_we}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_wm}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_ce}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_we}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_ce}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_we}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_wm}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_ce}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_we}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_wm}]
set_load -pin_load 0.1900 [get_ports {OUT_powerOff}]
set_load -pin_load 0.1900 [get_ports {OUT_reboot}]
set_load -pin_load 0.1900 [get_ports {s_axi_arid}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlock}]
set_load -pin_load 0.1900 [get_ports {s_axi_arvalid}]
set_load -pin_load 0.1900 [get_ports {s_axi_awid}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlock}]
set_load -pin_load 0.1900 [get_ports {s_axi_awvalid}]
set_load -pin_load 0.1900 [get_ports {s_axi_bready}]
set_load -pin_load 0.1900 [get_ports {s_axi_rready}]
set_load -pin_load 0.1900 [get_ports {s_axi_wlast}]
set_load -pin_load 0.1900 [get_ports {s_axi_wvalid}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_addr[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[20]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[19]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[18]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[17]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[16]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_DCT_data[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_addr[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[31]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[30]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[29]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[28]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[27]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[26]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[25]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[24]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[23]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[22]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[21]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[20]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[19]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[18]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[17]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[16]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_data[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_wm[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_wm[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_wm[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_DC_wm[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_addr[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[20]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[19]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[18]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[17]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[16]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_ICT_data[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_addr[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[31]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[30]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[29]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[28]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[27]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[26]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[25]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[24]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[23]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[22]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[21]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[20]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[19]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[18]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[17]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[16]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_IC_data[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[39]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[38]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[37]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[36]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[35]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[34]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[33]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[32]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[31]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[30]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[29]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[28]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[27]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[26]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[25]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[24]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[23]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[22]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[21]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[20]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[19]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[18]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[17]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[16]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbg[0]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[15]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[14]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[13]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[12]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[11]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[10]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[9]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[8]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[7]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[6]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[5]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[4]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[3]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[2]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[1]}]
set_load -pin_load 0.1900 [get_ports {OUT_dbgMemC[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[31]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[30]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[29]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[28]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[27]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[26]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[25]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[24]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[23]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[22]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[21]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[20]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[19]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[18]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[17]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[16]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[15]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[14]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[13]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[12]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[11]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[10]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[9]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[8]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[7]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[6]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[5]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[4]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_araddr[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arburst[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arburst[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arcache[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arcache[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arcache[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arcache[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[7]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[6]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[5]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[4]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arlen[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arsize[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arsize[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_arsize[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[31]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[30]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[29]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[28]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[27]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[26]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[25]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[24]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[23]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[22]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[21]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[20]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[19]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[18]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[17]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[16]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[15]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[14]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[13]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[12]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[11]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[10]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[9]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[8]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[7]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[6]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[5]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[4]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awaddr[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awburst[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awburst[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awcache[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awcache[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awcache[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awcache[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[7]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[6]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[5]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[4]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awlen[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awsize[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awsize[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_awsize[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[31]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[30]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[29]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[28]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[27]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[26]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[25]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[24]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[23]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[22]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[21]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[20]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[19]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[18]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[17]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[16]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[15]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[14]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[13]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[12]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[11]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[10]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[9]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[8]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[7]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[6]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[5]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[4]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wdata[0]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wstrb[3]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wstrb[2]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wstrb[1]}]
set_load -pin_load 0.1900 [get_ports {s_axi_wstrb[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 3.0000 [current_design]
set_max_fanout 6.0000 [current_design]
